app/controllers/goals_controller.rb

  def show
    @goal = Goal.find(params[:id])
---
SELECT `goals`.* FROM `goals` WHERE `goals`.`id` = 980190963 LIMIT 1

  def edit
    @goal = Goal.find(params[:id])
---
SELECT `goals`.* FROM `goals` WHERE `goals`.`id` = 51848956 LIMIT 1

  def create
    @goal = Goal.new(params[:goal])
    respond_to do |format|
      if @goal.save
---
INSERT INTO `goals` (`created_at`, `description`, `due_on`, `is_complete`, `is_template`, `short_title`, `startup_id`, `title`, `updated_at`) VALUES ('2013-04-27 05:34:14', 'some description', '2013-04-27', 1, NULL, NULL, NULL, 'test', '2013-04-27 05:34:14')