app/controllers/milestones_controller.rb

SELECT `milestones`.* FROM `milestones`
---
  def index
=begin
    @milestones = Milestone.all(:include => :tasks)