app/controllers/tasks_controller.rb

  def show
    @task = Task.find(params[:id])
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1018350804 LIMIT 1

  def edit
    @task = Task.find(params[:id])
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1018350804 LIMIT 1

  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1018350804 LIMIT 1
UPDATE `tasks` SET `title` = 'afwef', `description` = 'awfewafe', `owner_id` = -40, `is_complete` = 0, `due_on` = '2013-04-28', `updated_at` = '2013-04-28 18:04:16' WHERE `tasks`.`id` = 1018350804

  def destroy
    @task = Task.find(params[:id])
    @task.destroy
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1018350796 LIMIT 1
DELETE FROM `tasks` WHERE `tasks`.`id` = 1018350796