app/controllers/users_controller.rb

  def destroy
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 0 LIMIT 1